// // - Є змінна х, якій ви надаєте довільне числове значення.
// //     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
// let x = +prompt('Введіть число');
// if (x !== 0){
//     console.log('Вірно');
// }else {
//     console.log('Невірно');
// }

// // - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// // (в першу, другу, третю или четверту частину години).
// let time = +prompt('котра хвилина')
// if (time  >=0 && time <= 15  ){
//     console.log('перша четверть');
// }else if (time  >=16 && time <= 30  ){
//     console.log('друга четверть');
// }else if (time  >=31 && time <= 45  ) {
//     console.log('третя четверть');
// }else if (time  >=46 && time <= 59  ) {
//     console.log('четверта четверть');
// } else {console.log('читай уважно запитання')}

// // - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
// let day = +prompt('яке сьогодні число?');
// if (day > 0 && day <= 10) {
//     console.log('Перша декада');
// } else if (day > 10 && day <= 20) {
//     console.log('Друга декада');
// } else if (day > 20 && day <= 31) {
//     console.log('Третя декада');
// } else {
//     console.log('Щось не те вводиш');
// }

// // - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день
// // (можна замість плану на день, назву дня англійською).
// switch (+prompt('номер дня тижня')) {
//     case 1:
//         console.log('справи на понеділок');
//         break;
//     case 2:
//         console.log('справи на вівторок');
//         break;
//     case 3:
//         console.log('справи на середу');
//         break;
//     case 4:
//         console.log('справи на четвер');
//         break;
//     case 5:
//         console.log('справи на пятницю');
//         break;
//     case 6:
//         console.log('справи на суботу');
//         break;
//     case 7:
//         console.log('справи на неділю');
//         break;
//     default:  console.log('інформація введена не вірно');
// }


// //     - Користувач вводить або має два числа.
// //         Потрібно знайти та вивести максимальне число з тих двох .
// //         Також потрібно врахувати коли введені рівні числа.
// let num1 = +prompt('перше число');
// let num2 = +prompt('друге число');
// if (num1>num2){
//     console.log(`Число ${num1} є більшим за ${num2} `);
// }else if (num1<num2){
//     console.log(`Число ${num2} є більшим за ${num1} `);
// }else if (num1===num2){
//     console.log(`Значення ${num1} рівні`);
// }else { console.log('знаення не коректні')}

// //     - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
// //         за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)
//
// let x = '' ||'default';
// console.log(x);
//
// let a = ''
// if (!a) {
//     a = 'default'
//     console.log(a);
// } else console.log(a);
//
// let y ='';
// if ( typeof y !== true) {
//     y = 'default'
//     console.log(y);
// } else console.log(y);
